eisup_2019_docmng_integration/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ОКП</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Активная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Catalogs/ХарактеристикиНоменклатуры/Forms/ФормаСпискаУправляемая/Module.bsl
&НаКлиенте
Процедура ДобавитьАртикул(Команда)
	
	НовыйАртикул = "";
	
	Если НЕ ВвестиСтроку(НовыйАртикул, "Введите новый артикул.", 100, Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьХарактеристику(НовыйАртикул); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере 
Процедура СоздатьХарактеристику(СтрокаАртикул, Отказ = Ложь)
	
	ТекНоменклатура = Неопределено;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") И ЭлементОтбора.Использование Тогда
			
			ТекНоменклатура = ЭлементОтбора.ПравоеЗначение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекНоменклатура.Пустая() Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не выбрана номенклатура.", Отказ);
		
	ИначеЕсли НЕ ТекНоменклатура.ВестиУчетПоХарактеристикам Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("По номенклатуре не ведется учет по характеристикам.", Отказ);
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоАртикул = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Артикул");
	
	НайденнаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(СтрокаАртикул, Истина, , ТекНоменклатура);
	
	Если НЕ НайденнаяХарактеристика.Пустая() Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Такой артикул уже есть в базе.", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем характеристику
	НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	
	НоваяХарактеристика.Владелец 		= ТекНоменклатура;	
	НоваяХарактеристика.Наименование 	= СтрокаАртикул;
	НоваяХарактеристика.Активная		= Истина;
	
	НоваяХарактеристика.Записать();
	
	НаборЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	
	НаборЗначенияСвойств.Отбор.Объект.Установить(ТекНоменклатура);
	НаборЗначенияСвойств.Отбор.Свойство.Установить(СвойствоАртикул);
	
	ЗаписьЗначениеСвойства = НаборЗначенияСвойств.Добавить();
	ЗаписьЗначениеСвойства.Объект 	= ТекНоменклатура;
	ЗаписьЗначениеСвойства.Свойство = СвойствоАртикул;
	
	ЗначениеСвойства = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаАртикул, Истина, ,СвойствоАртикул);
	
	Если ЗначениеСвойства.Пустая() Тогда
		НовоеЗначениеСвойтсва = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
		НовоеЗначениеСвойтсва.Наименование 	= СтрокаАртикул;
		НовоеЗначениеСвойтсва.Владелец		= СвойствоАртикул;
		НовоеЗначениеСвойтсва.Записать();
	КонецЕсли;
	
	ЗаписьЗначениеСвойства.Значение = НовоеЗначениеСвойтсва.Ссылка;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
